{
  "backend/main.mo": "Motoko actor defining ReferralLink and Contact types with functions to submit contacts, track/redirect referral link clicks with counter increments, and query referral links by ID or all links.",
  "feature_evidence.json": "Feature evidence report documenting Pinterest Tag tracking script implementation in frontend/index.html with tag ID '2614024734220' for page view tracking.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a Pinterest-inspired portfolio site with referral link tracking, warm color palette, responsive navigation, and backend integration.",
  "frontend/index.css": "Tailwind CSS base layer defining CSS custom properties for light and dark themes using OKLCH color system with warm, earthy tones for a Pinterest-inspired design.",
  "frontend/index.html": "HTML entry point with Pinterest Tag tracking script initialization (tag ID 2614024734220) for page view analytics and noscript fallback image.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClientProvider and rendering all page sections (Navigation, Hero, About, Portfolio, Services, Testimonials, ContactForm, Footer) plus Toaster.",
  "frontend/src/components/About.tsx": "About section component displaying three feature cards (Creative Excellence, Strategic Approach, Proven Results) with icons and descriptions in a responsive grid.",
  "frontend/src/components/BoardCard.tsx": "Clickable referral link card component that calls useReferralTracking mutation to track clicks via backend before redirecting to target URL, with loading state overlay.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with name, email, and message fields that submits via useContactForm hook and displays success state with confirmation message.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, quick navigation links with smooth scroll, social media icons (Pinterest, Instagram, Facebook), and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, headline, description, and CTA buttons that scroll to portfolio and contact sections.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar with logo, desktop/mobile menu, scroll-based styling, and smooth scrolling to page sections.",
  "frontend/src/components/Portfolio.tsx": "Portfolio section that fetches and displays referral links as a grid of BoardCard components with loading and error states.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying a service icon, title, and description with hover effects and staggered animation.",
  "frontend/src/components/Services.tsx": "Services section showcasing three service offerings (Curated Collections, Quality Recommendations, Easy Discovery) using ServiceCard components.",
  "frontend/src/components/TestimonialCard.tsx": "Reusable testimonial card component displaying a quote, author name, and role with decorative quote icon and hover effects.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section displaying three client testimonials in a grid layout using TestimonialCard components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, handling authentication state and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useContactForm.ts": "React Query mutation hook for submitting contact form data through the backend actor with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching referral links and tracking clicks, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy color palette (terracotta primary, sage secondary) for both light and dark modes, inspired by Pinterest aesthetics.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom fonts (Inter, Playfair Display, Montserrat), OKLCH color system mapping to CSS variables, custom border radii, shadows, and animations.",
  "project_state.json": "Project metadata tracking implemented features for a Pinterest referral/affiliate link business website, including homepage, portfolio gallery converted to referral showcase, services section, contact form, testimonials, navigation, and click tracking functionality with Pinterest Tag integration."
}