{
  "backend/main.mo": "Main actor defining ReferralLink and Contact types with functions to submit contacts, track clicks on referral links (incrementing clickCount), and query referral links by ID or retrieve all links.",
  "backend/migration.mo": "Migration module that adds a new Nioxin System 2 Cleanser Shampoo referral link to the existing referralLinks list during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the product thumbnail image generation feature for Amazon referral links, referencing Portfolio.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, and configuration files with descriptions of their functionality and styling approach.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy color palette using OKLCH color system for both light and dark modes.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Pinterest Portfolio application.",
  "frontend/src/App.tsx": "Root application component wrapping all page sections with QueryClientProvider for React Query and Toaster for notifications.",
  "frontend/src/components/About.tsx": "About section displaying three feature cards (Creative Excellence, Strategic Approach, Proven Results) with icons and animated fade-in effects.",
  "frontend/src/components/BoardCard.tsx": "Clickable referral link card that tracks clicks via backend mutation before redirecting to target URL, with loading state and error handling.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with name, email, and message fields that submits to backend via custom hook and displays success/error states with animations.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, quick navigation links, social media icons, and attribution to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, headline, CTA buttons for browsing recommendations and contact, and a scroll-down arrow animation.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar with logo, desktop/mobile menu, scroll-based styling, and smooth scrolling to page sections (Home, About, Portfolio, Services, Testimonials, Contact).",
  "frontend/src/components/Portfolio.tsx": "Portfolio section that fetches and displays referral links as a grid of BoardCard components, with loading/error states and fallback image handling.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying a service icon, title, and description with hover effects and staggered animation delays.",
  "frontend/src/components/Services.tsx": "Services section showcasing three service offerings (Curated Collections, Quality Recommendations, Easy Discovery) using ServiceCard components.",
  "frontend/src/components/TestimonialCard.tsx": "Reusable testimonial card component displaying a quote, author name, and role with a decorative quote icon and hover effects.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section displaying three client testimonials in a grid layout using TestimonialCard components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, handling authentication state changes and invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useContactForm.ts": "React Query mutation hook for submitting contact form data through the backend actor, with loading/success/error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching referral links and tracking clicks through mutations, with automatic cache invalidation on successful mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy color palette (terracotta, sage, brown) inspired by Pinterest, including both light and dark mode themes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom fonts (Inter, Playfair Display, Montserrat), OKLCH color system mapping to CSS variables, custom border radii, shadows, and animations.",
  "project_state.json": "Project state document describing a referral-based Pinterest account business website with features including homepage, portfolio/referral showcase, services section, contact form, testimonials, navigation, and click tracking for affiliate links."
}